** Import pandas as pd.**

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
%matplotlib inline

** Read Salaries2.csv as a dataframe called sal.**

In [5]:
sal = pd.read_csv ('Salaries2.csv')

** Check the head of the DataFrame. **

In [6]:
sal.head()

,Unnamed: 0,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.00,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN
2,2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.60,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN
3,3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.00,56120.71,198306.90,NaN,332343.61,332343.61,2011,NaN,San Francisco,NaN
4,4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.60,9737.00,182234.59,NaN,326373.19,326373.19,2011,NaN,San Francisco,NaN

** Use the .info() method to find out how many entries there are.**

In [7]:
sal.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 90000 entries, 0 to 89999
Data columns (total 14 columns):
Unnamed: 0          90000 non-null int64
Id                  90000 non-null int64
EmployeeName        90000 non-null object
JobTitle            90000 non-null object
BasePay             89997 non-null float64
OvertimePay         90000 non-null float64
OtherPay            90000 non-null float64
Benefits            53841 non-null float64
TotalPay            90000 non-null float64
TotalPayBenefits    90000 non-null float64
Year                90000 non-null int64
Notes               0 non-null float64
Agency              90000 non-null object
Status              0 non-null float64
dtypes: float64(8), int64(3), object(3)
memory usage: 9.6+ MB

In [8]:
sal.describe()

,Unnamed: 0,Id,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Status
count,90000.000000,90000.000000,89997.000000,90000.000000,90000.000000,53841.000000,90000.000000,90000.000000,90000.000000,0.0,0.0
mean,44999.500000,45000.500000,72544.570476,5788.750062,4215.883805,29408.895073,82546.786191,100140.167520,2011.787956,NaN,NaN
std,25980.906451,25980.906451,42742.569218,12332.237434,8764.660853,14264.203428,50684.305761,62415.129772,0.739278,NaN,NaN
min,0.000000,1.000000,-166.010000,0.000000,-7058.590000,0.000000,0.000000,0.000000,2011.000000,NaN,NaN
25%,22499.750000,22500.750000,46048.400000,0.000000,0.000000,26142.690000,49710.907500,54521.690000,2011.000000,NaN,NaN
50%,44999.500000,45000.500000,71430.030000,0.000000,1124.000000,32709.400000,81235.790000,101018.425000,2012.000000,NaN,NaN
75%,67499.250000,67500.250000,102466.040000,5929.567500,5167.972500,37680.440000,115080.047500,139976.412500,2012.000000,NaN,NaN
max,89999.000000,90000.000000,319275.010000,245131.880000,400184.250000,86533.210000,567595.430000,567595.430000,2013.000000,NaN,NaN

,Unnamed: 0,Id,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Status
count,90000.000000,90000.000000,89997.000000,90000.000000,90000.000000,53841.000000,90000.000000,90000.000000,90000.000000,0.0,0.0
mean,44999.500000,45000.500000,72544.570476,5788.750062,4215.883805,29408.895073,82546.786191,100140.167520,2011.787956,NaN,NaN
std,25980.906451,25980.906451,42742.569218,12332.237434,8764.660853,14264.203428,50684.305761,62415.129772,0.739278,NaN,NaN
min,0.000000,1.000000,-166.010000,0.000000,-7058.590000,0.000000,0.000000,0.000000,2011.000000,NaN,NaN
25%,22499.750000,22500.750000,46048.400000,0.000000,0.000000,26142.690000,49710.907500,54521.690000,2011.000000,NaN,NaN
50%,44999.500000,45000.500000,71430.030000,0.000000,1124.000000,32709.400000,81235.790000,101018.425000,2012.000000,NaN,NaN
75%,67499.250000,67500.250000,102466.040000,5929.567500,5167.972500,37680.440000,115080.047500,139976.412500,2012.000000,NaN,NaN
max,89999.000000,90000.000000,319275.010000,245131.880000,400184.250000,86533.210000,567595.430000,567595.430000,2013.000000,NaN,NaN

**What is the average BasePay ?**

In [21]:
print ([BasePay,mean])

NameError: name 'BasePay' is not defined

72544.57047613862

** What is the highest amount of OvertimePay in the dataset ? **

245131.88

** What is the job title of  JOSEPH DRISCOLL ? Note: Use all caps, otherwise you may get an answer that doesn't match up (there is also a lowercase Joseph Driscoll). **

24    CAPTAIN, FIRE SUPPRESSION
Name: JobTitle, dtype: object

** How much does JOSEPH DRISCOLL make (including benefits)? **

24    270324.91
Name: TotalPayBenefits, dtype: float64

** What is the name of highest paid person (including benefits)?**

,Unnamed: 0,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.0,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN

0    NATHANIEL FORD
Name: EmployeeName, dtype: object

'NATHANIEL FORD'

'NATHANIEL FORD'

'NATHANIEL FORD'

** What is the name of lowest paid person (including benefits)? Do you notice something strange about how much he or she is paid?**

,Unnamed: 0,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
36156,36156,36157,PAULETTE ADAMS,"STATIONARY ENGINEER, WATER TREATMENT PLANT",0.0,0.0,0.00,NaN,0.00,0.00,2011,NaN,San Francisco,NaN
36157,36157,36158,KAUKAB MOHSIN,TRANSIT OPERATOR,0.0,0.0,0.00,NaN,0.00,0.00,2011,NaN,San Francisco,NaN
36158,36158,36159,JOSEPHINE MCCREARY,MANAGER IV,0.0,0.0,0.00,NaN,0.00,0.00,2011,NaN,San Francisco,NaN
36155,36155,36156,JOE BROWN JR,TRANSIT OPERATOR,0.0,0.0,0.30,NaN,0.30,0.30,2011,NaN,San Francisco,NaN
72924,72924,72925,Donald Clark,Transit Operator,0.0,0.0,1.77,0.14,1.77,1.91,2012,NaN,San Francisco,NaN

** What was the average (mean) BasePay of all employees per year? (2011-2014) ? **

Year
2011     63595.956517
2012     65436.406857
2013    106806.032271
Name: BasePay, dtype: float64

** How many unique job titles are there? **

2107

2107

** What are the top 5 most common jobs? **

Transit Operator    3366
TRANSIT OPERATOR    2388
Registered Nurse    2333
Police Officer 3    1574
Special Nurse       1563
Name: JobTitle, dtype: int64

** How many Job Titles were represented by only one person in 2013? (e.g. Job Titles with only one occurence in 2013?) **

182

** How many people have the word Chief in their job title? (This is pretty tricky) **

468

** Bonus: Is there a correlation between length of the Job Title string and Salary? **

                  title_len  TotalPayBenefits
title_len          1.000000         -0.051951
TotalPayBenefits  -0.051951          1.000000